### Revenues

Run the cell below to load the revenues for a retail company for 2 seperate years.

In [1]:
import pandas as pd

revenues = pd.DataFrame({
    2015: ['10232431p', '11432812p', '12938450p', '30432209p', '20110887p', '14903945p',
           '16774532p', '14687687p', '30462134p', '39768256p', '58342173p', '80107291p'],
    2016: ['9187174p', '10242983p', '11143096p', '30954299p', '20333143p', '16780122p',
           '18430973p', '15090314p', '31286712p', '41552798p', '60131181p', '84270667p'],
}, index=['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec'])

revenues

          2015       2016
Jan  10232431p   9187174p
Feb  11432812p  10242983p
Mar  12938450p  11143096p
Apr  30432209p  30954299p
May  20110887p  20333143p
Jun  14903945p  16780122p
Jul  16774532p  18430973p
Aug  14687687p  15090314p
Sep  30462134p  31286712p
Oct  39768256p  41552798p
Nov  58342173p  60131181p
Dec  80107291p  84270667p

Check the data types of each column first:

In [2]:
# Run this cell

revenues.dtypes

2015    object
2016    object
dtype: object

These numbers are given in pence, but the analysis should be carried out in Â£. 

Write a function to strip off the 'p', and divide by 100.

Map this function onto columns `2015` and `2016`.

In [3]:
def convert_to_pounds(pence_str):
    pence = float(pence_str.rstrip('p'))
    pounds = pence / 100
    return pounds

for column in [2015, 2016]:
    revenues[column] = revenues[column].map(convert_to_pounds)

Now check the dtypes of each column again, to make sure you have floats:

In [4]:
revenues.dtypes

2015    float64
2016    float64
dtype: object

What was the total revenue for 2015?

In [5]:
revenues[2015].sum()

3401928.0700000003

and 2016?

In [6]:
revenues[2016].sum()

3494034.6200000001

Create a new column `"Change"` with the change in revenues between 2015 and 2016.

In [7]:
revenues['Change'] = revenues[2016] - revenues[2015]
revenues

          2015       2016    Change
Jan  102324.31   91871.74 -10452.57
Feb  114328.12  102429.83 -11898.29
Mar  129384.50  111430.96 -17953.54
Apr  304322.09  309542.99   5220.90
May  201108.87  203331.43   2222.56
Jun  149039.45  167801.22  18761.77
Jul  167745.32  184309.73  16564.41
Aug  146876.87  150903.14   4026.27
Sep  304621.34  312867.12   8245.78
Oct  397682.56  415527.98  17845.42
Nov  583421.73  601311.81  17890.08
Dec  801072.91  842706.67  41633.76

Create a new column `"Percentage Change"` with the percentage change in revenues between 2015 and 2016.

In [8]:
revenues['Percentage Change'] = (revenues['Change'] / revenues[2015]) * 100
revenues

          2015       2016    Change  Percentage Change
Jan  102324.31   91871.74 -10452.57         -10.215139
Feb  114328.12  102429.83 -11898.29         -10.407142
Mar  129384.50  111430.96 -17953.54         -13.876113
Apr  304322.09  309542.99   5220.90           1.715584
May  201108.87  203331.43   2222.56           1.105153
Jun  149039.45  167801.22  18761.77          12.588459
Jul  167745.32  184309.73  16564.41           9.874737
Aug  146876.87  150903.14   4026.27           2.741255
Sep  304621.34  312867.12   8245.78           2.706895
Oct  397682.56  415527.98  17845.42           4.487353
Nov  583421.73  601311.81  17890.08           3.066406
Dec  801072.91  842706.67  41633.76           5.197250

### Tech Firms (Some More)

Run the cell below to load the tech firms in again

In [9]:
tech_firms = pd.read_json('data/tech_firms.json')
# Shows the first 5 rows
tech_firms.head()

,Company,FY,Headquarters,Market cap ($B),Revenue ($B)
0,Apple Inc.,2016,"Cupertino, CA, US",815.39,215.6
1,Amazon.com,2016,"Seattle, WA, US",478.00,135.9
2,Samsung Electronics,2016,"Suwon, South Korea",311.00,173.9
3,Foxconn,2016,"New Taipei City, Taiwan",66.00,135.1
4,Alphabet Inc.,2016,"Mountain View, CA, US",676.00,90.2

Write a function that takes in a string and returns `True` if the string ends with `'US'` and returns `False` otherwise.

In [10]:
def is_america(hq_str):
    if hq_str.endswith('US'):
        return True
    else:
        return False

Map this function onto the column `"Headquarters"`.

In [11]:
tech_firms['Headquarters'].map(is_america)

0      True
1      True
2     False
3     False
4      True
5      True
6     False
7      True
8     False
9     False
10    False
11     True
12     True
13     True
Name: Headquarters, dtype: bool

Use this mapping to select only the companies whose `Headquarters` is in the US.

In [12]:
tech_firms[tech_firms['Headquarters'].map(is_america)]

,Company,FY,Headquarters,Market cap ($B),Revenue ($B)
0,Apple Inc.,2016,"Cupertino, CA, US",815.39,215.6
1,Amazon.com,2016,"Seattle, WA, US",478.00,135.9
4,Alphabet Inc.,2016,"Mountain View, CA, US",676.00,90.2
5,Microsoft,2016,"Redmond, WA, US",561.00,85.3
7,IBM,2016,"Armonk, NY, US",145.00,79.9
11,Dell Technologies,2016,"Austin, TX, US",14.00,64.8
12,Intel,2016,"Santa Clara, CA, US",163.00,59.3
13,Hewlett Packard Enterprise,2016,"Palo Alto, CA, US",30.00,50.1

What is the revenue of the companies on the list that are in the US?

In [13]:
billion = 1 * 10 ** 9

tech_firms.loc[tech_firms['Headquarters'].map(is_america), 'Revenue ($B)'].sum() * billion

781100000000.0

You can use a tilde (~) to return the opposite case.

For example:

`df[df['Col1'] > 5]`

Will return all rows for which column `"Col1"` is greater than 5.

However,

`df[~df['Col1'] > 5]`

Will return all rows for which column `"Col1"` is *not* greater then 5.

Using the tilde, what is the revenue of the companies on the list that are not in the US?

In [14]:
tech_firms.loc[~tech_firms['Headquarters'].map(is_america), 'Revenue ($B)'].sum() * billion

609800000000.00012

### Cleaning Strings

Some people filled in a form with their first names, last names and heights. 

However the height field was a free text field and there was no error checking. Your job is to clean up these heights.

All the heights are given in metric but the string formats are different

Run the cell below to see the table.

In [15]:
heights = pd.DataFrame([
    {"first_name": "Stephanie", "last_name": "Bambery", "height": "1.60 metres"},
    {"first_name": "Barnard", "last_name": "Darbey", "height": '1m 80cm'},
    {"first_name": "Gale", "last_name": "Blind", "height": "154"},
    {"first_name": "Corry", "last_name": "Erbe", "height": "1 meter 80"},
    {"first_name": "Godard", "last_name": "Haslam", "height": "170 cm"},
    {"first_name": "Raimundo", "last_name": "Pelman", "height": "172 cm"}, 
    {"first_name": "Evvie", "last_name": "Rathke", "height": "165"},
    {"first_name": "Darius", "last_name": "Hymers", "height": "1.67 m"}
], columns=['first_name', 'last_name', 'height'])

heights

  first_name last_name       height
0  Stephanie   Bambery  1.60 metres
1    Barnard    Darbey      1m 80cm
2       Gale     Blind          154
3      Corry      Erbe   1 meter 80
4     Godard    Haslam       170 cm
5   Raimundo    Pelman       172 cm
6      Evvie    Rathke          165
7     Darius    Hymers       1.67 m

They are currently strings but you would like them as floats in centimetres.

Write a function that will read in all of these height strings, convert them to centimetres, strip out any non-digit characters and return a float.

_Hint: have a look back at the presentation at the string transformation functions_

In [16]:
def digits_from_str_as_float(input_str):
    """
    Function that takes in a string and returns only digits or decimal points
    from that string without using regular expressions
    """
    list_of_digits = [x for x in input_str if x.isdigit() or x == '.']
    digits_as_str = ''.join(list_of_digits)
    digits_as_float = float(digits_as_str)
    return digits_as_float


def clean_string(height_str):
    # remove spaces from either side
    height_str = height_str.strip(' ')
    if height_str.endswith('m') and not height_str.endswith('cm'):
        # remove m
        height_str = height_str.rstrip('m')
        # convert to float and multiply by 100
        return float(height_str) * 100
    elif height_str.endswith('metres'):
        # remove m
        height_str = height_str.rstrip('metres')
        # convert to float and multiply by 100
        return float(height_str) * 100
    else:
        return digits_from_str_as_float(height_str)

heights['height'] = heights['height'].map(clean_string)

heights

  first_name last_name  height
0  Stephanie   Bambery   160.0
1    Barnard    Darbey   180.0
2       Gale     Blind   154.0
3      Corry      Erbe   180.0
4     Godard    Haslam   170.0
5   Raimundo    Pelman   172.0
6      Evvie    Rathke   165.0
7     Darius    Hymers   167.0